
#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура Расш1_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	ВосстановитьНастройки();
	ДатаНачала = НачалоМесяца(ТекущаяДатаСеанса());
	ДатаОкончания = КонецМесяца(ДатаНачала);
	Организация = ХранилищаНастроек.НастройкиПользователей.Загрузить("ОсновнаяОрганизация");
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = Константы.ОсновнаяОрганизация.Получить();
	КонецЕсли;
	ЭтаФорма.АвтоОтображениеСостояния = РежимАвтоОтображенияСостояния.НеОтображать;
	ПараметрДК = Новый ПараметрКомпоновкиДанных("ДатаОкончания");

КонецПроцедуры
#КонецОбласти
